In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import os
plt.style.use('seaborn-colorblind')
%matplotlib inline

In [2]:
use_cols = [
    'Pclass', 'Sex', 'Age', 'Fare', 'SibSp',
    'Survived'
]

data = pd.read_csv('./data/titanic.csv', usecols=use_cols)
print(data.shape)
data.head(8)

(891, 6)

   Survived  Pclass     Sex   Age  SibSp     Fare
0         0       3    male  22.0      1   7.2500
1         1       1  female  38.0      1  71.2833
2         1       3  female  26.0      0   7.9250
3         1       1  female  35.0      1  53.1000
4         0       3    male  35.0      0   8.0500
5         0       3    male   NaN      0   8.4583
6         0       1    male  54.0      0  51.8625
7         0       3    male   2.0      3  21.0750

In [24]:
def check_missing(data,output_path = None):
    """
    check the total number & percentage of missing values
    per variable of a pandas Dataframe
    """
    
    result = pd.concat([data.isnull().sum(),data.isnull().mean()],axis = 1)
    result = result.rename(index = str,columns = {0 : 'Total Missing',1 : 'Propotion'})
    if output_path is not None:
        result.to_csv(output_path+'missing.csv')
        print('result Saved at',output_path,'missing.csv')
    return result

In [25]:
check_missing(data,output_path=r'./output/')

result Saved at ./output/ missing.csv

          Total Missing  Propotion
Survived              0   0.000000
Pclass                0   0.000000
Sex                   0   0.000000
Age                 177   0.198653
SibSp                 0   0.000000
Fare                  0   0.000000

In [33]:
def drop_missing(data,axis = 0):
    """
    Listwise deletion:
    excluding all cases (listwise) that have missing values
    Parameters
    ----------
    axis: drop cases(0)/columns(1),default 0
    Returns
    ------
    Pandas dataframe with missing cases/columns dropped
    """
    data_copy = data.copy(deep = True)
    data_copy = data_copy.dropna(axis = axis,inplace = False)
    return data_copy

### Listwise deletion

In [35]:
# 177 cases which has NA has been dropped
data2 = drop_missing(data)
data2.shape

(714, 6)

### Add a variable to denote NA
#### creating an additional variable indicating whether the data was missing for that observation

In [36]:
def add_var_denote_NA(data,NA_col = []):
    """
    creating an additional variable indicating whether the data 
    was missing for that observation (1) or not (0).
    """
    data_copy = data.copy(deep = True)
    for i in NA_col:
        if data_copy[i].isnull().sum() > 0:
            data_copy[i+'_is_NA'] = np.where(data_copy[i].isnull(),1,0)
        else:
            warn("Column %s has no missing cases" % i)
            
    return data_copy

In [37]:
# Age_is_NA is created, 0-not missing 1-missing for that observation
data3 = add_var_denote_NA(data=data,NA_col=['Age'])
print(data3.Age_is_NA.value_counts())
data3.head(8)

0    714
1    177
Name: Age_is_NA, dtype: int64

   Survived  Pclass     Sex   Age  SibSp     Fare  Age_is_NA
0         0       3    male  22.0      1   7.2500          0
1         1       1  female  38.0      1  71.2833          0
2         1       3  female  26.0      0   7.9250          0
3         1       1  female  35.0      1  53.1000          0
4         0       3    male  35.0      0   8.0500          0
5         0       3    male   NaN      0   8.4583          1
6         0       1    male  54.0      0  51.8625          0
7         0       3    male   2.0      3  21.0750          0

### Arbitrary Value Imputation
#### Replacing the NA by arbitrary values

In [40]:
def impute_NA_with_arbitrary(data,impute_value, NA_col = []):
    """
    replacing NA with arbitrary values. 
    """
    data_copy = data.copy(deep=True)
    for i in NA_col:
        if data_copy[i].isnull().sum() > 0:
            data_copy[i+'_'+str(impute_value)] = data_copy[i].fillna(impute_value)
        else:
            warn("Column %s has no missing cases" % i)
            
    return data_copy

In [41]:
data4 = impute_NA_with_arbitrary(data=data,impute_value=-999,NA_col=['Age'])
data4.head(8)

   Survived  Pclass     Sex   Age  SibSp     Fare  Age_-999
0         0       3    male  22.0      1   7.2500      22.0
1         1       1  female  38.0      1  71.2833      38.0
2         1       3  female  26.0      0   7.9250      26.0
3         1       1  female  35.0      1  53.1000      35.0
4         0       3    male  35.0      0   8.0500      35.0
5         0       3    male   NaN      0   8.4583    -999.0
6         0       1    male  54.0      0  51.8625      54.0
7         0       3    male   2.0      3  21.0750       2.0

### Mean/Median/Mode Imputation
#### Replacing the NA by mean/median/mode of that variable

In [80]:
def impute_NA_with_avg(data,strategy = 'mean',NA_col = []):
    """
    replacing the NA with mean/median/most frequent values of that variable. 
    Note it should only be performed over training set and then propagated to test set.
    """
    data_copy = data.copy(deep=True)
    for i in NA_col:
        if data_copy[i].isnull().sum() > 0:
            
            if strategy=='mean':
                data_copy[i+'_impute_mean'] = data_copy[i].fillna(data[i].mean())
            elif strategy=='median':
                data_copy[i+'_impute_median'] = data_copy[i].fillna(data[i].median())
            elif strategy=='mode':
                data_copy[i+'_impute_mode'] = data_copy[i].fillna(data[i].mode()[0])
       
        else :
            warn('Column %s has no missing" % i')
    return data_copy

In [82]:
print(data.Age.median())
data5 = impute_NA_with_avg(data=data,strategy='mode',NA_col=['Age'])
data5.head(8)

28.0

   Survived  Pclass     Sex   Age  SibSp     Fare  Age_impute_mode
0         0       3    male  22.0      1   7.2500             22.0
1         1       1  female  38.0      1  71.2833             38.0
2         1       3  female  26.0      0   7.9250             26.0
3         1       1  female  35.0      1  53.1000             35.0
4         0       3    male  35.0      0   8.0500             35.0
5         0       3    male   NaN      0   8.4583             24.0
6         0       1    male  54.0      0  51.8625             54.0
7         0       3    male   2.0      3  21.0750              2.0

### End of distribution Imputation
#### replacing the NA by values that are at the far end of the distribution of that variable calculated by mean + 3*std

In [83]:
def impute_NA_with_end_of_distribution(data,NA_col = []):
    """
    replacing the NA by values that are at the far end of the distribution of that variable
    calculated by mean + 3*std
    """
    data_copy = data.copy(deep = True)
    for i in NA_col:
        if data_copy[i].isnull().sum() > 0:
            data_copy[i+'_impute_end_of_dist'] = data_copy[i].fillna(data[i].mean()+3*data[i].std())
        else:
            warn("Column %s has no missing" % i)
    return data_copy

In [84]:
data6 = impute_NA_with_end_of_distribution(data=data,NA_col=['Age'])
data6.head(8)

   Survived  Pclass     Sex   Age  SibSp     Fare  Age_impute_end_of_dist
0         0       3    male  22.0      1   7.2500                22.00000
1         1       1  female  38.0      1  71.2833                38.00000
2         1       3  female  26.0      0   7.9250                26.00000
3         1       1  female  35.0      1  53.1000                35.00000
4         0       3    male  35.0      0   8.0500                35.00000
5         0       3    male   NaN      0   8.4583                73.27861
6         0       1    male  54.0      0  51.8625                54.00000
7         0       3    male   2.0      3  21.0750                 2.00000

### Random Imputation
#### replacing the NA with random sampling from the pool of available observations of the variable

In [93]:
def impute_NA_with_random(data,NA_col = None,random_state = 0):
    """
    replacing the NA with random sampling from the pool of available observations of the variable
    """
    data_copy = data.copy(deep = True)
    for i in NA_col:
        if data_copy[i].isnull().sum() > 0:
            data_copy[i+'_random'] = data_copy[i]
            # extract the random sample to fill the na
            random_sample = data_copy[i].dropna().sample(data_copy[i].isnull().sum(),random_state = random_state)
            random_sample = data_copy[data_copy[i].isnull()].index
            data_copy.loc[data_copy[i].isnull(),str(i)+'_random'] = random_sample
        else:
            warn("Column %s has no missing" % i)
    return data_copy

In [94]:
data7 = impute_NA_with_random(data=data,NA_col=['Age'])
data7.head(8)

   Survived  Pclass     Sex   Age  SibSp     Fare  Age_random
0         0       3    male  22.0      1   7.2500        22.0
1         1       1  female  38.0      1  71.2833        38.0
2         1       3  female  26.0      0   7.9250        26.0
3         1       1  female  35.0      1  53.1000        35.0
4         0       3    male  35.0      0   8.0500        35.0
5         0       3    male   NaN      0   8.4583         5.0
6         0       1    male  54.0      0  51.8625        54.0
7         0       3    male   2.0      3  21.0750         2.0